{"_ttSettingsTextStylesAdd":"<p>\rClicking the <i>Add a new text style button</i> will create a new <i>Text style</i> with a default name and attribute set.\r</p><p/><p>\rThe name and attributes can be changed by selecting the new <i>Text style</i>.\r</p>","_ttSettingsDrawingGridDivisions":"The <i>Grid divisions</i> setting defines the minor grid line spacing by specifying the number of \rdivisions between the major grid lines.","_ttSettingsLayersName":"The layer <i>Name</i> option lets you select an existing layer that you can view, modify or delete using this diaog.","_ttSettingsDrawingDimensionPrecision":"<p>\rThe dimensioning <i>Precision</i> option lets you control the amount of precision in \rthe automatic dimensioning values.\r</p><p/><p>\rFor &quot;Architects&quot; scale drawings, the options specify the minimum fraction of an inch displayed.  \rFor <i>Metric</i> and &quot;Engineers&quot; scale drawings, the options specify the number of decimal digits displayed.","_ttSettingsTextStylesDelete":"<p>\rClicking the <i>Delete selected text style</i> button will delete the selected text style. \r</p><p/><p>\rIf the selected <i>Text style</i> is used by any objects in the current drawing \rthis button is disabled.\r</p>","_ttSettingsLayersCount":"The <i>Number of objects on this layer</i> value shows the number of objects in the current drawing \rthat are included in the selected layer.\r","_ttSettingsLayersLineThickness":"<p>\rThe <i>Line thickness</i> setting shows the default line thickness used to render objects on the selected layer.\r</p><p/><p>\rThe thickness is expressed in <i>Paper units</i>.\r</p>","_ttSettingsTextStylesCount":"<p>\rThe <i>Number of objects using this style</i> value shows the number of Text or Dimension objects in the current drawing\rthat are drawn using the selected <i>Text style</i>.\r</p><p/><p>\rIf this value is greater than 0 the style can't be deleted.\r</p>","_ttSettingsDrawingPaperUnit":"<p>The <i>Paper unit</i> option lets you select the units \ruser to measure sizes and distances on your printed drawing.\r</p><p/><p>\rPaper units are used to measure things on your drawing that are not part of the model, \rsuch as the paper size, text height, dimension attributes, line thickness, and dash lengths.\r</p><p/><p>\rThis option can be set to <i>Inches</i> or <i>Millimeters</i>. \r</p>\r","_ttSettingsDrawingDimensionShowUnits":"<p>\rThe <i>Show units in dimension string</i> check box lets you control whether or not \rthe unit name or symbol (10 vs. 10 mm) is shown in automatic dimension strings.\r</p><p/><p>\rThis setting is disabled for &quot;Architects&quot; scale drawings.\r</p>","_ttSettingsLayersVisible":"<p>\rThe <i>Layer is visible</i> checkbox controls whether objects on the selected layer are displayed or hidden.\r</p><p/><p>\rLayers can also be shown or hidden using the <i>Show or hide layers</i> control in the status bar.\r</p>","_ttSettingsLineTypesSample":"The <i>Line type sample</i> image shows how a line object drawn using the selected line type would look.","_ttSettingsDrawingGridIntensity":"The <i>Grid intensity</i> slider lets you adjust the visual intensity of the grid lines to an \rappropitate level for your computer display. \rThe nominal grid colors are set when you select your <i>Drawing theme</i>.","_ttSettingsDrawingScale":"<p/>\rThe <i>Drawing scale</i> setting defines the relationship between the size of your printed drawing  \rand the size of the real world objects that your drawing depicts.\r</p><p/><p>\rThe <i>Drawing scale</i> value is expressed as a ratio between the paper size and the model size, \rtaking into account the implicit differences between the selected paper and model units. \rFor example, in a feet/inches drawing using the \"Architects\" scale paradigm, \r1:1 is the same as 12\"=1'0\" (full size) and 1:48 is the same as 1/4\"=1'0\".\r</p>","_ttSettingsArrowStylesName":"The <i>Name</i> option lets you select existing <i>Arrow styles</i> that you can view, modify or delete.","_ttSettingsDrawingGridSpacing":"The <i>Major grid</i> spacing setting specifies the distance in model units between the major grid lines \rin your drawing.","_ttSettingsArrowStylesAspect":"The <i>Aspect ratio</i> setting defines the width of the arrow symbol relative to its length.","_ttSettingsLineTypesLayerCount":"<p>\rThe <i>Number of layers containing this Line type</i> value show the number of layers in the current drawing\rthat use the selected line type.\r</p><p/><p>\rIf this value is greater than 0 the line type can't be deleted.\r</p>","_ttSettingsDrawingModelUnit":"<p>\rThe <i>Model unit</i> option lets you select the unit used to measure things in your drawing that represent real world objects.\r</p><p/><p>\rThis option can be set to <i>Feet</i> or <i>Inches</i> if the <i>Paper unit</i> is <i>Inches</i>, \ror it can be set to <i>Millimeters</i>, <i>Centimeters</i> or <i>Meters</i> if the <i>Paper unit</i> is <i>Millimeters</i>.\r</p>","_ttSettingsLineTypesCount":"<p>\rThe <i>Number of objects using this Line type</i> value show the number of objects in the current drawing \rthat are drawn using the selected line type.\r</p><p/><p>\rIf this value is greater than 0 the line type can't be deleted.\r</p>","_ttSettingsLayersAdd":"<p>\rClicking the <i>Add a new layer</i> button will create a new layer with a default name and attribute set.\r</p><p/><p>\rThe name and attributes can be changed by selecting the new layer.\r</p>","_ttSettingsArrowStylesSample":"The <i>Arrow style sample</i> image shows how a Arrow object drawn using the selected <i>Arrow style</i> would look.","_ttSettingsArrowStylesType":"<p>\rThe <i>Arrow type</i> option specifes the basic shape used to define the arrow symbol.\r</p><p/><p>\rThe choices are <i>Filled Arrow</i>, <i>Arrow Outline</i>, <i>Open Arrow</i>, <i>Ellipse</i> and <i>Dot</i>.\r</p>","_ttSettingsTextStylesRename":"<p>\rThe <i>Rename</i> button (pencil icon) allows you to change the name of the selected Text style.\r</p><p/><p>\rClicking this button changes the <i>Name</i> control into an editable text box.\r</p>","_ttSettingsArrowStylesAdd":"<p>\rClicking the <i>Add a new arrow style</i> button will create a new <i>Arrow style</i> with a default name and attribute set.\r</p><p/><p>\rThe name and attributes can be changed by selecting the new <i>Arrow style</i>.\r</p>","_ttSettingsArrowStylesRename":"<p>\rThe <i>Rename</i> button (pencil icon) allows you to change the name of the selected Arrow style.\r</p><p/><p>\rClicking this button changes the <i>Name</i> control into an editable text box.\r</p>","_ttSettingsLineTypesRename":"<p>\rThe rename <i>Line type</i> button (pencil icon) allows you to change the name of the selected line type.\r</p><p/><p>\rClicking this button changes the <i>Name</i> control into an editable text box.\r</p>","_ttSettingsPatternsIntro":"<p>\rThe <i>Pattern Definitions</i> settings panel lets you view, modify or delete existing crosshatch <i>Pattern</i> definitions, \ror add new Pattern definitions.\r</p><p/><p>\r<i>Patterns</i> define the line pattern used when filling objects with \rcrosshatch lines rather than using a solid color fill.  \rThe color, line thickness, scale and rotation values of the pattern are specified for each filled object.","_ttSettingsArrowStylesCount":"<p>\rThe <i>Number of objects using this style</i> value shows the number of Arrow or Dimension objects in the current drawing\rthat are drawn using the selected <i>Arrow style</i>.\r</p><p/><p>\rIf this value is greater than 0 the style can't be deleted.\r</i>","_ttSettingsLineTypesAdd":"<p>\rClicking the <i>Add a new line type</i> button will create a new line type with a default name and attribute set.\r</p><p/><p>\rThe name and attributes can be changed by selecting the new line type.\r</p>","_ttSettingsTextStylesFont":"<p>\rThe <i>Font family</i> option shows the <i>Font family</i> that is used by the selected <i>Text style</i>.\r</p><p/><p>\rThe control shows a list of the Fonts installed on your system.\r</p>","_ttSettingsLineTypesLengths":"<p>\r<i>Line types</i> are defined by a list of alternating dash and gap lengths.\r</p><p/><p>\rWhen you enter a dash length, a corresponding gap length value will be displayed which you can change as desired. \rThe gap length defaults to half the corresponding dash length if it is the first gap, \rotherwise it defaults to the first gap length.\r</i>","_ttSettingsTextStylesSample":"The <i>Text style sample</i> image shows how a text paragraph drawn using the selected <i>Text style</i> would look.","_ttSettingsTextStylesHeight":"The <i>Font height</i> setting shows the nominal font height height in <i>Paper units</i> that is used by the selected <i>Text style</i>.","_ttSettingsArrowStylesDelete":"<p>\rClicking the <i>Delete selected arrow style</i> button will delete the selected Arrow style. \r</p><p/><p>\rIf the selected <i>Arrow style</i> is used by any objects in the current drawing \rthis button is disabled.\r</p>","_ttSettingsLayersColor":"<p>\rThe <i>Color</i> option shows the default color used to render objects on the selected layer.\r</p><p/><p>\rColors can be selected from a list of recent colors, \ror a new color can be selected by choosing the <i>Select a new color</i> option.\r</p>","_ttSettingsTextStylesIntro":"<p>\rThe <i>Text Style Definitions</i> settings panel lets you view, modify or delete existing Text style definitions,\ror add new <i>Text style</i> definitions.\r</p><p/><p>\r<i>Text styles</i> are used to specify a consistent set of attrbutes that define the style of\rvarious classes of text objects or dimension objects.\r</p>","_ttSettingsTextStylesOffset":"<p>\rThe <i>Offset</i> setting shows the offset from the insertion point(s) in <i>Paper units</i>  \rthat is used by the selected <i>Text style</i> to locate the text objects.\r</p><p/><p>\rThe <i>Offset</i> is the vertical distance from the insertion points to the baseline of the text object. \rFor right and left aligned text objects the offset value also defines the horizontal offset from the insertion point.\r</p>\r","_ttSettingsLineTypesName":"The <i>Name</i> option lets you select existing <i>Line types</i> that you can view, modify or delete.","_ttSettingsLayersRename":"<p>\rThe <i>Rename layer</i> button (pencil icon) allows you to change the name of the selected layer.\r</p><p/><p>\rClicking this button changes the layer name control into an editable text box. \rIf the Unassigned layer is selected, the rename button is disabled, \rsince this is a special layer that can't be renamed.\r</p>","_ttSettingsTextStylesLineSpacing":"<p>\rThe <i>Line spacing</i> setting defines the relative vertical spacing between text lines in a paragraph.\r</p><p/><p>\rThe <i>Line spacing</i> value specifies a ratio between the nominal text height and the distance between lines of text. \rA value of 1.0 means that the spacing is the spacing is the same as the text height and results in no space between lines. \rA value of 2.0 means that the spacing is twice the text height resulting in a spacing between lines equal to the text height. \r</p>","_ttSettingsLayersSample":"The layer sample shows a line object drawn using the selected layer, using the layer's color, line type and line thickness attributes.","_ttSettingsArrowStylesLength":"The <i>Arrow length</i> setting shows the nominal length of the Arrow symbol in <i>Paper units</i>.","_ttSettingsDrawingTheme":"<p>\rThe <i>Drawing theme</i> option allows you to select the color theme for your drawing.\r</p><p/><p>\rThe <i>Drawing theme</i> is a set of complementary colors that specify reasonable color defaults \rfor the drawing foreground, background and grids. \rFive default themes are provided (<i>Light</i>, <i>Dark</i>, <i>Blueline</i>, <i>Blueprint</i>, and <i>Sepia</i>).\r</p>","_ttSettingsDrawingIntro":"The <I>Drawing Settings</I> panel allows you to view and change settings related to your drawing.","_ttSettingsTextStylesName":"The <i>Name</i> option lets you select an existing <i>Text style</i> that you can view, modify or delete.","_ttSettingsDrawingSize":"The <i>Paper width</i> and <i>Paper height</i> settings specify the width and height of your printed drawing document in <i>Paper units</i>.","_ttSettingsLayersLineType":"<p>\rThe <i>Line type</i> option shows the default line type used to render objects on the selected layer.\r</p><p/><p>\rThe control shows a list of all <i>Line type</i> definitions in the current drawing. \r<i>Line types</i> can be modified or added using the <i>Line Type Definitions</i> setting panel.\r</p>","_ttSettingsLayersIntro":"<p>\rThe <i>Layer Definitions</i> settings panel lets you view, modify or delete existing layer definitions, \ror add new layer definitions.\r</p><p/><p>\rLayer definition values include the layer's name, \rand the default color, line type, and line thickness used to render objects on that layer.\r</p>","_ttSettingsArrowStylesIntro":"<p>\rThe <i>Arrow Style Definitions</i> settings panel lets you view, modify or delete existing <i>Arrow style</i> definitions, \ror add new <i>Arrow style</i> definitions.\r</p><p/><p>\r<i>Arrow styles</i> are used to specify a consistent set of attrbutes that define the style of \rarrow symbols used by Arrow objects or Dimension objects.\r</p>","_ttSettingsLayersDelete":"<p>\rClicking the <i>Delete selected layer</i> button will delete the selected layer.\r</p><p/><p>\rIf the selected layer is the <i>Unassigned</i> layer, or if the selected layer contains any objects, \rthis button is disabled.\r</i>","_ttSettingsApplicationIntro":"The Application Settings panel allows you to view and change settings related to the entire application, not just the current drawing.","_ttSettingsLineTypesIntro":"<p>\rThe <i>Line Type Definitions</i> settings panel lets you view, modify or delete existing line type definitions, \ror add new line type definitions.\r</p><p/><p>\rThe <i>Line type</i> attribute defines the dash pattern used to draw lines.  \r<i>Line type</i> definition attributes include the <i>Line type's</i> name, \rand a list of alternating dash and gap lengths.\r</p>","_ttSettingsTextStylesCharSpacing":"<p>\rThe <i>Character spacing</i> setting defines the relative horizontal spacing between glyphs (characters) in a text line.\r</p><p/><p>\rThe <i>Character spacing</i> value specifies a ratio between the nominal width of a glyph and the distance between glyphs.\r</p><p/><p>\rA value of 1 means normal spacing.  A value of 2 means that the space between characters is roughly the same as the nominal width of a glyph.\r</p>","_ttSettingsLineTypesDelete":"<p>\rClicking the <i>Delete selected Line type</i> button will delete the selected line type.\r</p><p/><p>\rIf the selected <i>Line type</i> is used by any objects in the current drawing, \ror if any <i>Layers</i> in the current drawing use the selected <i>Line type</i>, \rthis button is disabled.\r</p>","_ttSettingsPrivacySupport":"The <i>Privacy &amp; Support</i> settings panel is the place where you can provide feedback to the developers of <i>Back to the Drawing Board</i>, \rreport bugs, find help, or review the <i>High Camp Software</i> privacy policy.\r","_ttInsertGroupIntro":"<p>\rThe <i>Insert Group</i> tool lets you insert a saved symbol, a symbol from your <i>Symbol library</i>, or a group from your drawing.\r</p><p/><p>\rIf the group's alignment points are set, and the group is inserted into a line segment, \rthe the segment will be gapped, and the group will rotate to match the orientation of the segment.\r</p><p/><p>\rIf the group contains text attributes, the tool will prompt for the content.\r</p>\r","_ttInsertGroupFromFile":"<p>The <i>From file</i> option retrieves a previously saved symbol from your disk, or from the cloud. \r</p><p/><p>\rWhen you select <i>From file</i>, the standard Windows file picker is shown allowing you to navigate to your symbol folder and select a symbol.","_ttInsertGroupFromLibrary":"<p>\rThe <i>From library</i> option retrieves symbols from your <i>Symbol library</i>.\r</p><p/><p>\rThe <i>Symbol library</i> contains named groups in your drawing, \rand groups that you have saved in your application symbol library.\r</p>","_ttInsertGroupFromDrawing":"<p>\rThe <i>From drawing</i> option allows you to select a symbol or group \rfrom your drawing instead of selecting a saved symbol.  \r</p><p/><p>\rWhen using this option, the &quot;pick cursor&quot; is shown allowing you pick and insert a \rgroup.\r</p><p/><p>\rIf the group's alignment points are set, and the group is inserted into a line segment, \rthe the segment will be gapped, and the group will rotate to match the orientation of the segment.\r</p><p/><p>\rIf the group contains text attributes, you will be prompted for the content.\r</p>\r","_ttInsertGroupSelectionInfo":"<p>\rWhen a symbol is selected, a thumbnail image of the symbol is shown in this box.\r</p><p/><p>\rIf <i>From group</i> is selected, the pick cursor is shown in the box \rindicating that you will need to pick a group from your drawing.\r</p>","_ttInsertGroupLayer":"<p>\rThe <i>Layer</i> option allows you to select a layer for the new group.\r</p><p/><p>\rAny group members that are assigned to the <i>Unassigned</i> layer \rwill be drawn on this selected layer.  \rAny group members that are explicitly assigned to another layer will remain on that layer.\r</i>","_ttInsertGroupScale":"<p>\rThe <i>Scale</i> option specifies a scale factor that will be applied \rto the group when inserted.\r</p>","_ttInsertAlongLineIntro":"<p>\rThe <i>Insert along line</i> tool creates multiple copies of an object \rarranged along a line segment.\r</p><p/><p>\rThese copies will be equally spaced along the line segment, \reither by defining an explicit spacing value, or by distributing a \rspeciied number of copies between the start and end points \rof the line segment.\r<p/>","_ttInsertAlongArcIntro":"<p>\rThe <i>Insert along arc</i> tool creates multiple copies of an object \rarranged along a circular arc.\r</p><p/><p>\rThese copies will be equally spaced along the arc, \reither by defining an explicit spacing angle, or by distributing a \rspecifed number of copies between the start and end points \rof the arc.\r<p/>","_ttInsertAlongArcSpace":"<p>\rWhen the <i>Space along arc</i> option is selected, \reach copy will be separated by an explicit spacing angle. \r</p><p/><p>\rThe spacing angle is specified in the <i>Angle between objects</i> \rbox. \r</p>","_ttInsertAlongArcDistribute":"<p>\rWhen the <i>Distribute along arc</I> option is selected, \ra specific number of copies will be place at equal intervals \ralong the arc, regardless of its length. \r</p><p/><p>\rThe copy count is specified in the <i>Number of copies</i> box.\r</p>","_ttInsertAlongArcCopies":"The <i>Number of copies</i> value specifies the number of copies \rthat will be placed in the arc segment when the \r<i>Space aling arc</i> option is selected.","_ttInsertAlongArcSpacing":"The <i>Angle between copies</i> value specifies the angle value \rused when the <i>Space along arc<i/> option is selected.","_ttInsertAlongArcConnect":"When the <i>Connect with arc segments</i> box is checked, \ran arc segment will be drawn connecting the start point and end point through each of the copies.","_ttInsertAlongArcEnds":"<p>\rWhen the <i>Include copies at end points</i> box is checked \ra copy will be placed at the start point.  \r</p><p/><p>\rWhen the <i>Distribute along line</i> option is selected, \ra copy will also be place at the end of the segment.\r</p>","_ttSubMenu_file_open":"<p>\rThe <i>Open</i> menu item lets you open an existing drawing file or drawing template,  \ror import an existing DXF or SVG document.\r</p><p/><p>\rThis will replace the contents of your working drawing.\r</p>\r","_ttSubMenu_file_save":"<p>\rThe <i>Save</i> menu item will save your current drawing to the location \rfrom which it was loaded.  \r</p><p/><p>\rIf the current drawing has never been saved, the Windows <i>Save as...</i> \rdialog will be shown and you can select a new name and location.\r</p>","_ttSubMenu_file_save_as":"<p>\rThe <i>Save as</i> menu item allows you to save a copy of your \rcurrent drawing to a new location.  \r</p>","_ttSubMenu_file_save_template":"<p>\rThe <i>Save as template</i> menu item allows you to save your \rcurrent drawing as a <i>drawing template</i>.  \r</p><p/><p>\r<i>Drawing templates</i> are special drawing files that set up a \rstandard set of attributes for a class of drawings that share these \rattributes.  \rTemplates can also include graphic objects such as title blocks.\r</p><p/><p>\rTemplates can't be overwritten using the <i>Save</i> menu item. \rThe resulting drawing needs to be saved in a new location.\r</p>","_ttSubMenu_file_export":"<p>\rThe <i>Export</i> menu item lets you convert your drawing into \ranother format, typically so that it can be used by another application.\r</p><p/><p>\rSupported export formats include <i>DXF</i>, <i>SVG</i>, <i>PDF</i>, \r<i>JPG</i>, and <i>PNG</i>.\r</p>","_ttSubMenu_file_clear":"<p>\rThe <i>Clear drawing</i> menu item lets you delete all graphic \robjects while retaining most basic drawing attributes such as drawing \rsize, units, fonts, layers, line types and styles.\r</p><p/><p>\rThis can be useful when creating a template from an existing drawing.\r</p>\r","_ttSubMenu_file_print":"<p>\rThe <i>Print</i> menu item lets you print your current drawing.\r</p>","_ttSubMenu_modify_select_objects":"<p>\rThe <i>Select & modify</i> tool lets you select \ra set of objects and apply modifications to the entire set.\r</p>","_ttSubMenu_modify_edit_object":"<p>\rThe <i>Edit single object</i> tool lets you select \ra single object and make detailed modifications.\r</p>","_ttSubMenu_modify_edit_group":"<p>\rThe <i>Edit group</i> menu item lets you select a group member \rand make modifications that group member or the group itself.\r</p>","_ttSubMenu_info_properties":"<p>\rThe <i>Properties</i> tool lets you select a single object \rand view or change its properties.\r</p>","_ttSubMenu_info_origin":"<p>\rThe <i>Set drawing origin</i> tool lets you change the \rcoordinate origin of your drawing. \r</p>","_ttSubMenu_info_distance":"<p>\rThe <i>Distance</i> tool lets you measure distances on your drawing.\r</p>","_ttSubMenu_info_angle":"<p>\rThe <i>Angle</i> tool lets you measure the included angle \rbetween three points.\r</p>","_ttSubMenu_info_area":"<p>\rThe <i>Area</i> tool lets you measure and calculate \rthe area of irregular polygons.\r</p>","_ttSubMenu_view_window":"<p>\rThe <i>Set window</i> tool lets you define a new view \rof your drawing by dragging the cursor to define a rectangle. \rThe new view contains the extents of the rectangle.\r</p>","_ttSubMenu_view_view_all":"<p>\rThe <i>Display all</i> tool lets change the current view of \ryour drawing to include its full extents.\r</p>","_ttSubMenu_view_actual_size":"<p>\rThe <i>Display actual size</i> menu item lets you view your drawing \rso that it is shown at its actual print size on your display screen.\r</p>","_ttSubMenu_view_pan":"<p>\rThe <i>Pan</i> tool lets change your drawing view by \rdragging it to a new location, maintaining its viewport size.\r</p>","_ttSubMenu_view_pan_left":"<p>\rThe <i>Page left</i> tool changes your drawing view by \rmoving it one screen to the left, maintaining the viewport scale.\r</p>","_ttSubMenu_view_pan_right":"<p>\rThe <i>Page left</i> tool changes your drawing view by \rmoving it one screen to the right, maintaining the viewport scale.\r</p>","_ttSubMenu_view_pan_up":"<p>\rThe <i>Page left</i> tool changes your drawing view by \rmoving it up one screen, maintaining the viewport scale.\r</p>","_ttSubMenu_view_pan_down":"<p>\rThe <i>Page down</i> tool changes your drawing view by \rmoving it down one screen, maintaining the viewport scale.\r</p>","_ttMainMenuDraw":"<p>\rThe <i>Draw</i> menu contains commands that add simple graphic objects to your drawing.\r</p><p/><p>\rGraphic objects include lines, polygons, curves, double lines, circles, \rarcs and ellipses.  Closed objects can optionally be filled with a solid \rcolor or a crosshatch pattern.\r</p>","_ttMainMenu":"<p>\rThe <i>Main menu</i> is the place where you initiate commands and tools.  \rSelecting from the main menu will display a submenu of \rindividual commands and tools. \rIf the tool has options, they will be shown in a dialog flyout \rto the right of the submenu.\r</p><p/><p>\rClick the 'hamburger' button (the top icon) to expand the main menu and show the \rtext titles for each menu icon.\r</p>","_ttMainMenuHome":"<p>\rClick the <i>Home</i> button to close your drawing and \rnavigate back to the home page.  \r</p><p/><p>\rYou can return to your drawing from the Home page by selecting \rthe 'Current drawing' tile.\r</p>","_ttMainMenuFile":"The <i>File</i> menu contains commands that open, \rsave, import, export, print, or clear your drawing.","_ttMainMenuAnnotation":"<p>\rThe <i>Annotation</i> menu contains commands that add \rannotation objects to your drawing.\r</p><p/><p>\rAnnotation objects include text, dimensions and arrows (or leaders). \rThe sizing attributes for these objects are defined in <i>Paper</i> units.\r</p>","_ttMainMenuInsert":"The <i>Insert</i> menu contains commands that add symbols and images \rto your drawing.","_ttMainMenuSettings":"The <i>Settings</i> menu contains commands that let you \rview or modify data associated with your drawing or the \rapplication.\r","_ttMainMenuEdit":"The <i>Edit</i> menu contains commands that modify existing objects to your drawing.","_ttMainMenuInfo":"The <i>Info</i> menu contains commands that allow you to get or change information about your drawing, or objects in your drawing.","_ttMainMenuView":"The <i>View</i> menu contains commands that change the \rarea of your drawing that is visible on your screen.\r","_ttMainCoordinateEntry":"<p>\rClick the <i>Coordinate entry</i> button to show the floating \r<i>Coordinate entry</i> panel.\r</p><p/><p>\rThe <i>Coordinate entry</i> panel allows you to enter absolute, \rdelta (relative) or polar coordinates while using any graphic tool.\r</p><p/><p>\rThe coordinate entry button is disabled when no graphic tool is active.\r<p />","_ttMainCoordinateDisplay":"<p>\rThe <i>Coordinate display</i> field shows the coordinates of the \rlocation of the cursor in model units.\r</p><p/><p>\rThe <i>Coordinate display</i> field is disabled when no graphic tool is active.\r<p />","_ttMainActiveLayer":"<p>\rThe <i>Active layer</i> field shows the currently selected \ractive layer.  Clicking this field shows the active layer menu \rwhich allows you to select a new layer.\r</p><p/><p>\rNew graphic objects are drawn on the <i>Active layer</i> \runless the layer is overridden in the current <i>Draw</i> or \r<i>Annotation</i> dialog.\r</p>\r","_ttMainVisibleLayers":"<p>\rThe <i>Visible layers</i> button shows the <i>Visible layers</i> menu.\r</p><p/><p>\rThe <i>Visible layers</i> menu lets you show or hide individual layers. \rA check mark next to the layer name indicates that the layer is visible. \rClearing the check mark will hide that layer.\r</p>","_ttMainViewButtons":"<p>\rThe <i>View</i> buttons let you change the area of your drawing \rthat is displayed on your screen.\r</p><p/><p>\rClick the &#xE8A3; button to zoom in.\r</p><p/><p>\rClick the <Span FontFamily=\"Segoe MDL2 Assets\" FontSize=\"14\">&#xE71F;</Span> button to zoom out.\r</p><p/><p>\rClick the <Span FontFamily=\"Segoe MDL2 Assets\" FontSize=\"14\">&#xE740;</Span> button to show the entire drawing.\r</p>","_ttMainRulerButton":"Click the <i>Toggle rulers</i> button to show or hide the rulers \rat the top and left edges of the drawing window.","_ttMainGridButton":"Click the <i>Toggle grid</i> button to show or hide the drawing \rwindow grid.","_ttMainSnapButton":"<p>\rClick the <i>Object snap</i> button to show the <i>Object snap</i> \rmenu.  This menu allows you to enable or disable the grid snap and \robject snap features.\r</p><p/><p>\rYou can also select whether the grid snap increment remains \rconstant when you zoom in (Whole or Half grid snap), \ror changes to a finer increment as you zoom in (Automatic grid snap).\r</p>","_ttMainTriangleButton":"Click the <i>Triangle</i> button to show or hide the triangle.","_ttMainUndoButton":"<p>\rClick the <i>Undo</i> button (&#xE7A7;) \rto undo the last operation(s).  \r</p><p/><p>\rClick the <i>Redo</i> button ( &#xE7A6;) to redo an operation \rthat has been undone.\r","_ttMainHelp":"Select from the <i>Help</i> menu to start or continue the \rUX tour or report a bug.","_ttMainIntro":"<p>\rWelcome to the new <p /><b>Back to the Drawing Board</b>\r</p><p/><p>\rThis is a preview of the new <i>Back to the Drawing Board</i> user experience (UX).\r</p><p/><p>\rThe primary UX elements are the <i>Main menu</i>  on \rthe left edge of the screen and the <i>Status bar</i> on the bottom \redge of the screen.  \r</p><p/><p>\rThe <i>Main menu</i> is used to initiate commands \rand tools while the <i>Status bar</i> allows you to monitor  \rthe drawing environment and make changes while using the various tools.\r</p><p/><p>\rWe have included a UX tour that provides a brief \rintroduction to each of these user interface elements.\r</p><p/><p>\rIf for some reason you prefer the legacy UX, return to the <i>Home page</i> \rand select <i>Legacy UX</i> from the <i>UX Version</i> menu \rin the bottom app bar.\r</p>","_ttInsertImageIntro":"<p>\rThe <i>Insert image</i> tool lets you insert a JPG or PNG image \rinto your drawing.\r</p><p/><p>\rYou can select an existing JPG or PNG file from your disk or take a \rpicture using your computer's camera if it is so equipped.\r</p><p/><p>\rOnce an image is selected, you can edit it by clicking the \r<i>Edit image</i> button. \r</p><p/><p>\rWhen you dismiss the dialog, your image will be inserted into your \rdrawing. You can drag or resize the image by manipulating the \rhandles at the corners of the image.  \rYou can maintain the image's aspect \rratio by holding the shift key down while resizing.\r</p>\r","_ttInsertImageFile":"<p>The <i>From file</i> option lets you retrieve an image file  \rfrom your disk, or from the cloud. \r</p><p/><p>\rThe standard Windows file picker will be  shown, \rallowing you to navigate to to the proper folder and select an image.\r</p>","_ttInsertImageCamera":"<p>The <i>From camera</i> option lets you take a picture using \ryour computer's camera  if it is so equipped.\r</p>","_ttInsertImageLayer":"<p>\rThe <i>Layer</i> option allows you to select a layer for the new image.\r</i>","_ttInsertImageOpacity":"<p>\rThe <i>Opacity</i> slider lets you control the opacity of your image.\r</p>","_ttInsertImageThumbnail":"<p>\rWhen an image is selected, a thumbnail is shown in this box.\r</p><p/><p>\rWhen you edit the image using the <i>Edit image</i> button, \rthe changes will be reflected in the thumbnail.\r</p>","_ttInsertImageEdit":"<p>\rClicking the <i>Edit image</i> button will show the \rimage editing dialog. \r</p><p/><p>\rUsing this dialog, you can resize, crop, rotate, straighten, or apply \ra variety of image processing filters to  your image.\r</p>","_ttSettingsApplicationMouse":"<p>\rThis control specifies which mouse button is used to initiate the \rlive pan function.  \rWhile holding down the selected button, \rthe current view of your drawing will change as the mouse is moved.\r</p><p/><p>\rThe functionality of each named button may differ depending \r on the specific \rmake and model of your mouse.\r</p>","_ttDrawLineFreehand":"<p>\rThe <i>Freehand</i> option allows you to draw continuous lines \rfollowing the cursor.  \r</p><p/><p>\rUnlike most tools, the freehand option draws continuously while the cursor is \rdepressed rather than entering a point each time the cursor button \ris pressed.\r</p>","_ttDrawLineFilletRadius":"The <i>Radius</i> value is used to define the radius of the fillet \rwhen the <i>Fillet</i> tool is active.","_ttDrawAttributesLine":"<p>\rNormally, the <i>Active layer</i> defines the color, line thickness, \rand line type (dash pattern) for new objects.  \rThe active layer is set using the <i>Active layer</i>  control in the \rstatus bar. \r</p><p/><p>\rThe <i>Active layer</i> can be overridden using the <i>Layer</i> \rcontrol in this dialog.  \rIf the layer is overridden in this way (i.e. not set to <i>Use active layer</i>), \rchanging the layer using the status bar control has no effect.\r</p><p/><p>\rLikewise, the color, line type, and line thickness can \rbe overridden individually.  \rThe attribute overrides remain in effect until they are changed, \ror a new layer is selected.\r</p>","_ttDrawPolygonIntro":"<p>\rThe <i>Polygon</i> tool is used to draw regular or irregular polygons. \r</p><p/><p>\r Regular polygons have a specified number of equal length sides.  \rIrregular polygons are similar to multi-segment lines except that \rthey are always closed. \r</p><p/><p>\rPolygons can be filled or not filled.\r</p>","_ttDrawPolygonRegular":"<p>\rThe <i>Regular</i> polygon option draws a polygon with \ra specific number of sides that are equal in length.   \rThe included angles at each corner are also equal.   \r</p><p/><p>\rThe polygon is defined by drawing a vector from its center point to \rone of its vertices.  \r</p><p/><p>\rThe number of sides is set in the <i>Number of sides</i> box below.\r</p>","_ttDrawPolygonIrregular":"<p>\rThe <i>Irregular</i> polygon option draws a series of connected line \rsegments that define the boundary of the polygon.  \r</p><p/><p>\rThe line can be terminated by double-clicking the last point, \ror by entering the escape key or the enter key after the last point \ris entered.\r</p>","_ttDrawPolygonFilletRadius":"<p>\rThe <i>Fillet radius</i> value is used to define the radius of fillets \rat corners of irregular polygons.\r</p><p/><p>\rIf the radius value is zero, the corners will not be filleted.\r</p>","_ttDrawAttributesFill":"<p>\rClosed objects can optionally be filled using a solid color or a \rcrosshatch pattern.\r</p><p/><p>\rIf the <i>Fill color</i> is set to a specific color (anything other than \r<i>No fill</i>), the object will be filled.\r</p><p/><p>\rIf the <i>Pattern name</i> is set to \"Solid\", \rthe object will be filled with a solid color, \rotherwise the the object will be crosshatched using the named \rcrosshatch pattern.  \r</p><p/><p>\rCrosshatch patterns can be scaled or \rrotated using the remaining controls.  \r</p><p/><p>\rA sample of the selected pattern using the current color, \rscale and angle is shown in the <i>Pattern sample</i> box.\r</p>","_ttDrawDoublelineIntro":"<p>\rThe <i>Doubleline</i> tool draws two parallel lines a specified \rdistance apart.   \rThe lines are equidistant from the imaginary centerline that connects \rthe points entered.   \r</p><p/><p>\rDoublelines can have open or closed ends.\r</p>","_ttDrawDoublelineEnds":"<p>\rThe <i>Cap ends</i> control specifies whether the ends of the \rdoubleline are open or closed.  \r</p><p/><p>\rYou can close the beginning of the doubleline, the end, both or neither.\r</p>","_ttDrawRectangleSize":"The <i>Size</i> option draws a rectangle centered on the cursor \rlocation using the specified <i>Width</i> and <i>Height</i> values.","_ttDrawRectangleWidth":"The <i>Width</i> and <i>Height</i> specify the size of the \rrectangle created when the <i>Size</i> option is used.","_ttDrawCircleIntro":"<p>\rThe <i>Circle</i> tool is used to draw full circles. \r</p><p/><p>\rCircular arcs can be drawn using the Arc tool.\r</p>","_ttDrawCircleRadius":"The <i>Radius</i> value defines the radius used when the \r<i>Center/radius</i> construction option is selected.","_ttDrawArcCenterStartEnd":"The <i>Center/start/end</i> option defines the arc by locating its \rcenter point, the point at which the arc starts (defining the radius), \rand a point that defines the end of the arc.","_ttDrawArcThreePoint":"The <i>3 point</i> option defines the arc by locating its start point, \rany point on its circumference, and its end point.","_ttDrawArcSemiCircle":"<p>\rThe <i>Semi circle</i> option defines a semi-circle (half circle) \rby locating its end points.  \r</p><p/><p>\rThe arc is drawn counter-clockwise between from the first point \rto the second point.\r</p>","_ttDrawArcRadiusCenterPoint":"The <i>Radius</i> option defines the arc by locating its center point, \ra point defining its start angle, point defining its end angle, \rand a <i>Radius</i> value.","_ttDrawArcRadiusAngles":"The <i>Radius &amp; angles</i> option defines the arc by locating \rits center point, and entering explicit values for its <i>Radius</i>, \r<i>Start angle</i>, and <i>Included angle</i>.","_ttDrawArcFillet":"<p>\rThe <i>Fillet</i> option draws an arc that is tangent to \rtwo intersecting lines.  \r</p><p/><p>\rThe intersecting lines are defined by entering three points, \rA, B &amp; C.  \rThe arc is drawn from the tangent point A on line AB \rto the to the tangent point on line BC.\r</p>","_ttDrawArcFilletRadius":"<p>\rThe <i>Fillet &amp; radius</i> option draws an arc that is tangent \rto two intersecting lines and having a specific radius.  \r</p><p/><p>\rThe arc is drawn tangent to two intersecting lines.  \r</p><p/><p>\rThe intersecting lines are defined by entering three points, \rA, B &amp; C.  \rThe arc is drawn with the specified radius from the tangent on line AB \rto the to the tangent point on line BC.\r</p>","_ttDrawArcRadius":"The <i>Radius</i> value defines the radius used for the \r<i>Radius</i>, <i>Radius &amp; angles</i>, \rand the <i>Fillet &amp; radius</i> construction options.","_ttDrawArcStartAngle":"The <i>Start angle</i> value defines the start angle used for \r<i>Radius &amp; angles</i> construction option.","_ttDrawArcIncludedAngle":"The <i>Included angle</i> value defines the included \r angle used for the <i>Radius &amp; angles</i> construction option.","_ttDrawEllipseBox":"<p>\rThe <i>Box</i> construction option draws ellipses inscribed in a \rrectangle defined by two opposite corners. \r</p><p/><p>\rThe axis angle is always 0°.\r</p>","_ttDrawEllipseAxis":"<p>\rThe <i>Axis</i> construction option defines ellipses by locating \rthe ends of the major axis.  \r</p><p/><p>\rThe axis angle is defined by the slope of the major axis.  \rThe minor axis length is determined by the<i> Major : minor ratio</i> \rvalue.\r</p>","_ttDrawEllipseCenterSize":"The <i>Center &amp; size</i> construction option defines ellipses \rby locating the center point, and supplying values for the \r<i>Major axis length</i>, <i>Major : minor ratio</i>, \rand <i>Axis angle</i>.","_ttDrawEllipseMajorAxis":"<p>\rThe <i>Major axis length</i> value specifies the length of the \rellipse's major axis.   \r</p><p/><p>This property is only enabled when the \r<i>Center &amp; size</i> construction option is selected.\r</i>","_ttDrawEllipseRatio":"<p>\rThe <i>Major : minor ratio</i> value defines the ratio between \rthe length of the major and minor axes.  \r</p><p/><p>\rThis property is enabled when the <i>Axis</i> or \r<i>Center &amp; size</i> construction options are selected.\r</p>","_ttDrawEllipseAxisAngle":"<p>\rThe <i>Axis angle</i> value secifies the angle of the major axis in \rdegrees counter-clockwise from horizontal.  \r</p><p/><p>\rThis property is only enabled for the <i>Center &amp; size</i> \rconstruction option.\r</p>","_ttDrawEllipseStartAngle":"<p>\rThe <i>Start angle</i> value defines the start angle value for \reliptical arcs in counter-clockwise degrees from horizontal.  \r</p><p/><p>\rThis property is enabled when the included angle is less than 360°.\r</p>","_ttDrawEllipseIncludedAngle":"<p>\rThe <i>Included angle</i> value defines the included angle for \reliptical arcs in counter-clockwise degrees.  \r</p><p/><p>\rThis property is always enabled.   \rWhen this value is less than 360°, \relliptical arcs will be drawn instead of full ellipses, \rregardless of the construction option selected.\r</p>","_ttAnnotationTextOnePoint":"<p>\rWhen using the <i>One point</i> text option, text objects are \rpositioned by locating a single point according the the \rcurrent alignment rules. \r</p><p/><p>\rSingle point text is normally drawn horizontally, \rbut it can be rotated using the <i>Rotation</i> value below. \r</p><p/><p>\rWhen objects containing single point text are rotated, \rthe text will remain at the specified angle.\r</p>","_ttAnnotationTextTwoPoint":"<p>\rWhen using the <i>Two point</i> text option, \rtext is drawn along a line defined by two points according to the \rcurrent alignment rules. \r</p><p/><p>\rLeft-aligned text is positioned relative to the first point. \rRight-aligned text is positioned relative to the second point. \rCenter-aligned text is centered between the two points.\r</p><p/><p>\rWhen objects containing text defined by two points are rotated, \rthe text objects will rotate along with the rest of the object.\r</p>","_ttAnnotationTextAlignment":"The <i>Alignment</i> option specifies how text is \raligned (or justified) relative to the location points.","_ttAnnotationTextPosition":"<p>\rThe <i>Position</i> option specifies how text is \rpositioned vertically relative to the location points.\r</p><p/><p>\rThe options are <i>Above</i>, <i>On</i> (centered), or <i>Below</i> \r the location points.  The position option applies the the entire \rparagraph when the text object contains multiple lines.\r</p>","_ttAnnotationTextStyle":"<p>\rThe <i>Text style</i> option specifies a named \rtext style which defines the font, size, offset, character spacing, \rand line spacing for text objects. \r</p><p/><p>\r<i>Text styles</i> can be created or modified using the \r<i>Text Style Definitions</i> settings panel.\r</p>","_ttAnnotationTextIntro":"The <i>Text</i> tool is used to create text objects.","_ttAnnotationTextLineSpacing":"<p>\rThe <i>Line spacing</i> value defines the vertical spacing value \rbetween lines of text in multi-line text objects (or paragraphs).  \rThis value is a ratio between the <i>Text height</i> and and the \ractual baseline-to-baseline spacing.\r</p><p/><p>\rThe <i>Line spacing</i> is typically defined by the <i>Text style</i> \rbut can be overridden using this control.\r</p>\r","_ttAnnotationTextSpacing":"<p>\rThe <i>Char spacing</i> value defines the horizontal spacing \rbetween characters (or glyphs) in a line of text. \rThis value is a ratio between the nominal width of a character \rand and the actual spacing between characters.  \r</p><p/><p>\rA value of 1 means that the glyphs are positioned  \ras the font designer intended. \rA value of 2 results in twice that spacing.\r</p><p/><p>\rThe <i>Char spacing</i> is typically defined by the <i>Text style</i> \rbut can be overridden using this control.\r</p>\r","_ttAnnotationTextFont":"<p>\rThe <i>Font family</i> value specifies the font family used to \rrender a text object.\r</p><p/><p>\rThe <i>Font family</i> is typically defined by the <i>Text style</i>,\rbut can be overridden using this control.\r</p>","_ttAnnotationTextAngle":"<p>\rThe <i>Rotation</i> value specifies the rotation value for \r<i>One point</i> text objects. \r</p><p/><p>\rThis value is disabled when the <i>Two point</i> option is selected.\r</p>","_ttAnnotationTextLayer":"<p>\rNormally, new objects are drawn on the <i>Active layer</i> \rselected in the status bar.  \rThe active layer can be overridden by selecting different layer \rusing this control.  \r</p><p/><p>\rIf this control is set to anything other than <i>Use active layer</i>, \rchanging the layer in the status bar control has no effect.\r</p>","_ttAnnotationTextColor":"<p>\rNormally, the <i>Color</i> of an object is defined by its layer.  \r</p><p/><p>\rSelecting a <i>Color</i> using this control overrides the layer \rcolor.\r</p>","_ttAnnotationTextHeight":"<p>\rThe <i>Text height</i> value defines the nominal height of a \rline of text.  This is a distance in paper units (not a 'point' value).\r</p><p/><p>\rThe <i>Text height</i> is typically defined by the <i>Text style</i> \rbut can be overridden using this control.\r</p>\r","_ttAnnotationArrowIntro":"<p>\rThe <i>Arrow tool</i> is used to draw \"leader lines\" \r(multi-segment lines with an arrow at one or both ends).\r</p><p/><p>\rArrows are typically used to call attention to some part of your \rdrawing.   \r</p>","_ttAnnotationArrowBoth":"<p>\rThe <i>Both ends</i> option draws arrows at both the beginning \rof the first segment, and the end of the last segment of an arrow \robject.\r</p>","_ttAnnotationArrowStyle":"<p>\rThe <i>Arrow style</i> option allows you to select a named\r<i>Arrow style</i> which defines the size and type of arrow.  \r</p><p/><p>\r<i>Arrow styles</i> can be created and modified in the \r<i>Arrow style definitions</i> settings panel.\r</p>","_ttAnnotationDimensionIntro":"<p>\rThe <i>Dimension</i> tool draws automatic linear and \rangular dimensions. \r</p><p/><p>\rThere are currently five supported types of dimensions: \rlinear baseline, linear incremental, point-to-point, incremental \rangular, and baseline angular.\r</p>","_ttAnnotationDimensionIncremental":"<p>\r<i>Incremental</i> linear dimensions measure incremental \rlinear distances along a reference line between the perpendicular \roffsets to a series of consecutive nodes.  \r</p>","_ttAnnotationDimensionBaseline":"<p>\r<i>Baseline</i> linear dimensions measure linear distances \ralong a reference line from the perpendicular offset to a single \ranchor node to the perpendicular offset to each subsequent \rnode.\r</p>","_ttAnnotationDimensionPoint2Point":"<p>\r<i>Point to point</i> linear dimensions measures incremental \rdistances between a series of connected nodes. \r</p><p/><p>\rThe actual distances are measured between each node \r(i.e. not along a reference line).\r</p>","_ttAnnotationDimensionAngular":"<p>\r<i>Angular</i> dimension measure the included angles \rfor a series of arc segments with a common center point.  \r</p><p/><p>\rEach arc segment is measured from the end of the previous arc \rsegment.\r</p>","_ttAnnotationDimensionBaselineAngular":"<p>\r<i>Baseline angular</i> dimensions measure the included angles \rfor a series of arc segments with a common center point.  \r</p><p/><p>\rEach arc segment is measured from the vector \rconnecting the center point with the first node, \rto the vector connecting the center point with each subsequent node.\r</p>","_ttAnnotationDimensionTextStyle":"<p>\rThe <i>Text style</i> option specifies a named \rtext style which defines the font, size, offset, character spacing, \rand line spacing for text objects. \r</p><p/><p>\r<i>Text styles</i> can be created or modified using the \r<i>Text Style Definitions</i> settings panel.\r</p>","_ttAnnotationDimensionArrowStyle":"<p>\rThe <i>Arrow style</i> option allows you to select a named\r<i>Arrow style</i> which defines the size and type of arrow.  \r</p><p/><p>\r<i>Arrow styles</i> can be created and modified in the \r<i>Arrow style definitions</i> settings panel.\r</p>","_ttAnnotationDimensionShowText":"The <i>Show dimension text</i> checkbox allows you to show or \rhide the automatic dimension text in the dimension object.","_ttInsertAlongLineSpace":"<p>\rWhen the <i>Space along line</i> option is used, \reach copy will be separated by an explicit spacing distance. \rThis distance value is specified in the <i>Spacing between objects</i> \rbox.\r</p.","_ttInsertAlongLineDistribute":"<p>\rWhen the <i>Distribute along line</I> option is selected, \ra specific number of copies will be place at equal intervals along the \rline segment, regardless of its length. \r</p><p/><p>\rThe copy count is specified in the <i>Number of copies</i> box.\r</p>","_ttInsertAlongLineSpacing":"The <i>Spacing between copies</i> value specifies the spacing \rvalue used when the <i>Space along line</i> option is selected.","_ttInsertAlongLineEnds":"<p>\rWhen the <i>Include copies at end points</i> is checked,\ra copy will be placed at the start point.  \r</p><p/><p>\rWhen the <i>Distribute along line</i> option is used, \ra copy will also be place at the end of the segment.\r</p>","_ttMainDoneButton":"<p>\rThe <i>Done</i> button can be used to terminate a multi-step operation \rsuch as creating a multi-segment line.\r</p><p/><p>\rThis is equivilant to pressing the <i>Escape</i> key on the keyboard.\r</p>","_ttSettingsDrawingHighlight":"<p>\rThe <i>Highlight color</i> option allows you to specify how \rhighlighted objects are differentiated from normal objects.\r</p><p/><p>\rWhen using the <i>Default experience</i>, highlighted \robjects are \"dimmed\" by redrawing them using a lighter shade \rof the objects color.  \r</p><p/><p>\rAlternatively, you can specify a special color \rwith which all highlighted objects are drawn.\r</p>","_ttSettingsDrawingTime":"<p/>\rThe <Active drawing time</i> control shows how long the current \rdrawing has been open in the app across all sessions.  \rThis value is \"read-only\" and can't be modified by the user.\r</p><p/><p>\rThis feature is new as of release 4.2.0.0.  \rDrawing activity in previous versions of the app is not included \rin the running total.\r</p>"}